In [5]:
import numpy as np

In [2]:
import pandas as pd

In [8]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [40]:
from numpy.random import randn

In [41]:
np.random.seed(101)

In [42]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
type(df['W'])

pandas.core.series.Series

In [21]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [45]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [46]:
df['new'] = df['W'] + df['X']

In [47]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [29]:
df.drop('new',axis=1,inplace=True)

In [31]:
df.drop('E',axis = 0,inplace  = True)

In [32]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [33]:
df.shape

(4, 4)

In [34]:
df[['X','Y']]

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905
C  0.072960  0.638787
D -0.754070 -0.943406

In [35]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [37]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [38]:
df.loc['B', 'Y']

0.16690463609281317

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [48]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [49]:
df > O

NameError: name 'O' is not defined

In [50]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [51]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118       NaN       NaN  0.605965  0.331800
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [53]:
boolser = df['W']>0

In [54]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [55]:
df[boolser]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [56]:
result = df[boolser]

In [57]:
result

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [59]:
mycols = ['Y','X']

In [61]:
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [6]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.433654 -0.288979
   2 -2.233289  0.473403
   3  0.082832 -2.129742
G2 1 -0.893212 -0.138927
   2  0.797557  1.856867
   3 -0.795965 -0.151376

In [9]:
df['A']

G1  1   -0.433654
    2   -2.233289
    3    0.082832
G2  1   -0.893212
    2    0.797557
    3   -0.795965
Name: A, dtype: float64

In [10]:
df.index.names = ["Groups","Num"]

In [11]:
df

                   A         B
Groups Num
G1     1   -0.433654 -0.288979
       2   -2.233289  0.473403
       3    0.082832 -2.129742
G2     1   -0.893212 -0.138927
       2    0.797557  1.856867
       3   -0.795965 -0.151376

In [14]:
df.loc["G1"].loc[1]['B']

-0.2889794873976571

                   A         B
Groups Num
G1     1   -0.433654 -0.288979
       2   -2.233289  0.473403
       3    0.082832 -2.129742
G2     1   -0.893212 -0.138927
       2    0.797557  1.856867
       3   -0.795965 -0.151376

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [7]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [8]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [15]:
df.fillna(value="FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [18]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [20]:
df = pd.DataFrame(data)

In [21]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
byComp = df.groupby("Company")

In [25]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
byPerson = df.groupby("Person")

In [28]:
byPerson.mean()

         Sales
Person
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [29]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [30]:
byComp.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [31]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [32]:
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [36]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [37]:
pwd

'D:\\Udemy\\Jose Portila Data Science\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [38]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [39]:
df = pd.read_csv("example")

In [51]:
df.to_csv("MY_output",index = False)

In [52]:
pd.read_csv("MY_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [54]:
pd.read_excel("Excel_Sample.xlsx",sheet_name = "Sheet1")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [55]:
df.to_excel("Excel_Sample2.xlsx",sheet_name = "New Sheet")

In [58]:
pd.read_excel("Excel_Sample2.xlsx",sheet_name = "New Sheet")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [61]:
data = pd.read_html("https://www.fdic.gov/transparency/bankapplications.html")

In [62]:
data

[  Disposition  Deposit Insurance  Branch  Change in Control  Merger  \
 0    Approved                  9     547                 12     126
 1      Denied                  0       0                  0       0
 2    Returned                  0       2                  1       4
 3   Withdrawn                  3      20                  4       0
 4      Totals                 12     569                 17     130

    Management Change  Total
 0                 82    776
 1                  0      0
 2                  2      9
 3                 29     56
 4                113    841  ,
   Unnamed: 0  Deposit Insurance  Branch  Change in Control  Merger  \
 0    Average                176      28                 78      64
 1     Median                165      22                 64      48

    Management Change Total
 0                 47     -
 1                 33     -  ,
                                           Unnamed: 0  \
 0                                            Average
 1                                             Median
 2                                    Timeframe Goal1
 3                       Total # Approved within Goal
 4                                            Percent
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                    Deposit Insurance  \
 0                                                116
 1                                                116
 2                                                120
 3                                                  6
 4                                                67%
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                               Branch  \
 0                                                 20
 1                                                 19
 2                                                 30
 3                                                504
 4                                                92%
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                    Change in Control  \
 0                                                 46
 1                                                 36
 2                                                 45
 3                                                  9
 4                                                75%
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                               Merger  \
 0                                                 49
 1                                                 43
 2                                                 60
 3                                                107
 4                                                85%
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                    Management Change  \
 0                                                 19
 1                                                 21
 2                                                 25
 3                                                 64
 4                                                78%
 5                                                NaN
 6  1Processing days from receipt of a substantial...

                                                Total
 0                                                  -
 1                                                  -
 2                                                  -
 3                                                689
 4                                                89%
 5                                                NaN
 6  1Processing days from receipt of a substantial...  ,
                                0                  1  \
 0              Bank Applications  Bank Examinations
 1  Deposit Insurance for Bankers      Legal Matters

                                          2
 0  Consumer Protection & Deposit Insurance
 1               Resolutions & Failed Banks  ]

In [63]:
type(data)

list

In [65]:
data[0].head()

,Disposition,Deposit Insurance,Branch,Change in Control,Merger,Management Change,Total
0,Approved,9,547,12,126,82,776
1,Denied,0,0,0,0,0,0
2,Returned,0,2,1,4,2,9
3,Withdrawn,3,20,4,0,29,56
4,Totals,12,569,17,130,113,841

In [67]:
from sqlalchemy import create_engine

In [69]:
engine = create_engine("sqlite:///:memory:")

In [71]:
df.to_sql("my_table",engine)

In [73]:
sqldf = pd.read_sql("my_table", con=engine)

In [74]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15